terms = {
    "남동향": "南東向き",  # 긴 문자열을 먼저 치환
    "남서향": "南西向き",  # 긴 문자열을 먼저 치환
    "북동향": "北東向き",  # 긴 문자열을 먼저 치환
    "북서향": "北西向き",  # 긴 문자열을 먼저 치환
    "남향": "南向き",    # 긴 문자열을 먼저 치환
    "북향": "北向き",    # 긴 문자열을 먼저 치환
    "동향": "東向き",    # 긴 문자열을 먼저 치환
    "서향": "西向き",    # 긴 문자열을 먼저 치환
    "열병합": "熱併合",
    "아파트": "アパート",
    "오피스텔": "オフィステル",
    "층": "階",
    "동": "棟",
    "호": "号",
    "저": "低",
    "중": "中",
    "고": "高",
    "평": "坪",
    "만원": "万ウォン",
    "세대": "世帯",
    "거실 기준": "リビング基準"
}